#+TITLE: Homework 6
#+AUTHOR: Bray Moll
#+OPTIONS: toc:nil
#+SETUPFILE: ~/masters/bray-standard-latex-export.org

** Solve
#+ATTR_LATEX: :options frame=single
#+BEGIN_SRC python :results output :exports both :session Python-Session

  from solver import solver
  from solver import mesher
  import numpy as np
  import plotnine as pn
  import pandas as pd
 #+END_SRC

 #+RESULTS:

#+ATTR_LATEX: :options frame=single
#+BEGIN_SRC python :results output :exports both :session Python-Session
  time_step_list =[0.05,0.1, 0.2]
  discretization_type_list =["upwind","central", "maccormack"]
  method_type_list = ["explicit","implicit", "explicit"]
  mesh_type_list = ["finite_volume", "finite_difference", "finite_difference"]
  n_cells_list = [100, 101, 101]
  zipped_list = zip(
      discretization_type_list,
      method_type_list,
      mesh_type_list,
      n_cells_list
  )

  solution_list = []
  for discritization, method , mesh_type, n_cells in zipped_list:
      for time_step in time_step_list:
          x = [0,10]
          # Create a Mesh
          mesh = mesher.linear_convection__mesh(
              x = x,
              n_cells = n_cells,
              mesh_type = mesh_type,
              discretization_type = discritization
          )
          # Set initial and boundary conditions
          mesh.set_dirichlet_boundary('left', 0)
          phi_initial = [
              np.sin(x) if x < np.pi else 0 for x in mesh.xcell_center
          ]
          mesh.set_phi(phi_initial)
          mesh.set_dirichlet_boundary('left', 0)

          # Create a solver
          simple_explicit_upwind = solver.linear_convection_solver(
              mesh = mesh,
              initial_time = 0,
              time_step_size = time_step,
              method = method,


          )
          # Solve to final time point
          simple_explicit_upwind.solve(2)

          #Save data to a single data frame
          data_data_frame = pd.DataFrame(simple_explicit_upwind.saved_data)
          solution_list.append(pd.DataFrame(simple_explicit_upwind.saved_data))

          #Report the solved configuration
          print(f'\nSolved Using')
          print(f'discritization: {discritization} \nmethod:{method}')
          print(f'mesh: {simple_explicit_upwind.mesh.mesh_type}')
          print(f'delta x: {mesh.delta_x}')
          print(f'delta t: {time_step}')
          print(f'courrant number: {simple_explicit_upwind.courant_coefficent}')

#+END_SRC

#+RESULTS:
#+begin_example

Solved Using
discritization: upwind
method:explicit
mesh: finite_volume
delta x: 0.1
delta t: 0.05
courrant number: 0.5

Solved Using
discritization: upwind
method:explicit
mesh: finite_volume
delta x: 0.1
delta t: 0.1
courrant number: 1.0

Solved Using
discritization: upwind
method:explicit
mesh: finite_volume
delta x: 0.1
delta t: 0.2
courrant number: 2.0

Solved Using
discritization: central
method:implicit
mesh: finite_difference
delta x: 0.1
delta t: 0.05
courrant number: 0.5

Solved Using
discritization: central
method:implicit
mesh: finite_difference
delta x: 0.1
delta t: 0.1
courrant number: 1.0

Solved Using
discritization: central
method:implicit
mesh: finite_difference
delta x: 0.1
delta t: 0.2
courrant number: 2.0

Solved Using
discritization: maccormack
method:explicit
mesh: finite_difference
delta x: 0.1
delta t: 0.05
courrant number: 0.5

Solved Using
discritization: maccormack
method:explicit
mesh: finite_difference
delta x: 0.1
delta t: 0.1
courrant number: 1.0

Solved Using
discritization: maccormack
method:explicit
mesh: finite_difference
delta x: 0.1
delta t: 0.2
courrant number: 2.0
#+end_example

